<template>
    <div>
        <swiper class="swiper" :options="swiperOption">
            <swiper-slide class="text">
                <div>
                    最近在抖音上被这样一句话刷屏了：“以后我们的关系就这样吧，如果接下来的日子里你不找我，那么我也不会主动找你，直到慢慢的没有交集。你的微信我不会删，电话也不会删，因为毕竟我们爱过。如果你给我发消息我还是会秒回你。但是没有任何期待了。我会放下手机继续等待。如果你来，我还是会原地等你，但这次我不知道会等多久，因为等一个人的期限是有限的，我也说不出你哪里好？只是你给了我别人给不了的感觉。”

　　我想写下这段话的那个人也曾全力以赴的付出过、满心欢喜的期待过吧！当一次次怀抱满心欢喜的期待，一次次的让自己的底线撕开一道道缺口，当那一次次期待变为一次次的失望，也就学着去转身了。我们每个人何尝不是这样呢？都以为某时某刻的温暖可以长久、可以完美到无懈可击。我们都期待故事能以完的结局划上句号，可这样的概率又有多少呢？

　　曾经我也天真地认为只要我足够努力我们的故事就会有好的结局，可现实给了我当头一击。曾经真的能拍着胸脯说我们是一辈子互相牵挂的人，是一辈子有说不完话的人，是一辈子我累了或者你累了可以相互依靠的人，是一辈子我说我需要一个肩膀了你会出现让我靠的人，我们一辈子会在彼此看得见的地方守护着彼此。可走着走着好像丢了好多，我不知道是我弄丢了你还是你弄丢了我？可总归是丢了……

　　曾几何时我们是那么的无话不谈，我们总是有说不完的话，讨论不完的问题。我也相信了以后，我曾把你的到来当做生命中的小确幸，你给的一点点好我都想炫耀，也记得你风尘仆仆的从另一个城市开车到我路过的城市只为在车站见一面，只为那几个小时的相见你说你一夜没睡冒着雨开车赶过来了，也记得你每次的秒回和主动，也记得和你一次次通话两个小时你的叮咛和嘱咐……在那一刻我尽看到了以后，也相信了你说的即使再怎么难也不会丢下我、也不会放开我的手。那一刻我也相信了我和别人的不一样，我也相信了你说承诺那一刻的真诚，可一颗真心终究敌不过距离和时间的挑唆，最后我们的关系也就这样了！你也没主动找过我，我也没有主动找过你……我还是在原地等你，可你却就那样连一句道别也没有。我知道从熬夜回复信息开始你就在我的生活中打开了一条缺口，你走了这个缺口却在那里。这个缺口就是改变习惯、放弃自己、就是我给你的太在乎……

　　就像有人说过：在几米的世界里，向左走，向右走，爱与错过，一步之遥；在现实生活里，信任与狗血，爱与恨，一步之遥。就是这一步之遥打开了我人生的的缺口，你就是那个永远也填满不了的缺口，撕裂开的的那一道道口子随着时间会有愈合的时候可那清晰可见的疤痕却也无法修补。

　　“我也说不出来你哪里好？只是你给了我别人给不了的感觉。”就像某些人，像坏习惯，戒不掉，也改不了。你给的那道缺口，就像你给的满心欢喜一样，那么深刻，那么猝不及防。

　　我们终究没有了交集，就像你我的遇见有些猝不及防，一切顺其自然、简单又美好。从陌生人变回陌生人，这就是我们的故事。

　　就像有人说过：其实想想，这个世界从不缺好的故事，故事的结局，静香没有嫁给大雄，晴子可能也就负责打开樱木花道的初恋大门，有人曾牵手，但不会走到最后。就像刚好在赶不同的列车，可能就与缘分失之交臂，抑或是原本以为能长久同行的人，结果提前下车了，看似遗憾，但人生海海，总要允许有人错过你，才能赶上最好的相遇。

　　是啊！故事的开头那么美好，故事的结尾却总是有失望。就像你走后的那道缺口看不见也摸不着可它曾是我如烟花般的满心欢喜。我知道这个缺口在遇见你时就已经打开了，只不过遇见你时打开的那个缺口是让步、是包容、是一次次的打破底线。你用我打开的缺口治好了我的忧郁，而后留下更深的缺口让我悲伤。忧郁和悲伤之间的片刻喜欢，便是这个缺口愈合不了的后遗症。

　　开始说好有过永远的两个人，后来却不再联系。这是你留给我的缺口，我曾想着这个缺口你会填满，所以我收起了自己的锋芒和戾气希望你来给这个缺口添上色彩，可色彩耀眼的东西终归不能逗留太长时间。虽然以后的缺口再无色彩可我还是很庆幸生命中有那一道缺口。也是有了这个缺口我知道你来过，我知道正是这一段段风格迥异的缺口使我的生命有了另一种色彩。

　　也许岁月会掩盖那些你曾到来和走后的缺口，可我还是想说：谢谢你给我的那些从前，谢谢你走后留给我的缺口，我会把那一道道缺口都交给时间，也许时间会给我一个可能，也是这个缺口让我为自己留下了一片天空。

　　我不苛求完美的人生，我知道遇上你错过你我的人生已经变得不完美了，可我还是无憾了，“我还是会等你，但这次我不知道等多久，因为等一个人是有期限的……”最终那道撕裂的缺口没被你填满可我也不会再无期限的让它去裂开了。

　　你给的缺口是满心欢喜也是忧郁和悲伤……。撕裂便会疼痛但也无法愈合……
                </div>
            </swiper-slide>
        </swiper>
    </div>
</template>

<script>
    import 'swiper/dist/css/swiper.css'
    import { swiper, swiperSlide } from 'vue-awesome-swiper'
    const swiperOption = {
                    direction: 'vertical',
                    slidesPerView: 'auto',
                    freeMode: true,
                    mousewheel: true,

                }
    export default {
        components: {
            swiper, swiperSlide 
        },
        data(){
            return {
                swiperOption:swiperOption
            }
        }
    }
</script>

<style  scoped>
    /* .swiper {
        overflow: hidden;
        height: 300px;
    }
    .text {
        font-size: 18px;
        text-align: center;
        padding: 30px;
        
    } */
</style>